In [3]:
import numpy as np
import pandas as pd

In [4]:
# creating a csv file with dictionary in python
dict1 = {
    "Name":['tushar', 'pranjal', 'ansh', 'sahil'],
    "Marks":[92,78,98,43],
    "City":['delhi','up','kolkata','chennai']
}

In [5]:
# DataFrame = A Pandas DataFrame is a 2 dimensional data 
# structure, like a 2 dimensional array, or a table with rows 
# and columns.
df = pd.DataFrame(dict1)

In [6]:
df

      Name  Marks     City
0   tushar     92    delhi
1  pranjal     78       up
2     ansh     98  kolkata
3    sahil     43  chennai

In [7]:
df.to_csv('details.csv') # to convert data into .csv file(excel)

In [8]:
df.to_csv('details_false_index.csv',index = False) # it will not show index

In [9]:
df.head(2) # it will show top 2 rows

      Name  Marks   City
0   tushar     92  delhi
1  pranjal     78     up

In [10]:
df.tail(2) # it will show bottom 2 rows

    Name  Marks     City
2   ansh     98  kolkata
3  sahil     43  chennai

In [11]:
df.describe() # it will show most of the mathematical operation on data

           Marks
count   4.000000
mean   77.750000
std    24.635679
min    43.000000
25%    69.250000
50%    85.000000
75%    93.500000
max    98.000000

In [12]:
tushar = pd.read_csv('tushar.csv') # it will read csv file

In [13]:
tushar

   Roll Class     Name  Marks
0     1     A   Tushar     99
1     2     B    Sahil     88
2     3     C  Pranjal     77
3     4     D     Ansh     66
4     5    EA  Devansh     55
5     6    EB   Kartik     44

In [17]:
tushar['Marks'][0] = 100 # it will change value of element

C:\Users\Tushar\AppData\Local\Temp\ipykernel_19700\3777439630.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tushar['Marks'][0] = 100

In [20]:
tushar

   Roll Class     Name  Marks
0     1     A   Tushar    100
1     2     B    Sahil     88
2     3     C  Pranjal     77
3     4     D     Ansh     66
4     5    EA  Devansh     55
5     6    EB   Kartik     44

In [21]:
tushar.to_csv('tushar.csv') # to append change in csv

In [24]:
tushar.index = ['first','second','third','fourth','fivth','sixth']

In [25]:
tushar

        Roll Class     Name  Marks
first      1     A   Tushar    100
second     2     B    Sahil     88
third      3     C  Pranjal     77
fourth     4     D     Ansh     66
fivth      5    EA  Devansh     55
sixth      6    EB   Kartik     44